; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	infrared1 - mode
	spectrograph0 - mode
	GroundStation3 - direction
	GroundStation2 - direction
	Star4 - direction
	Star0 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star4)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument6 spectrograph0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star4)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument7 spectrograph0)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 Star4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
	(supports instrument8 spectrograph0)
	(supports instrument8 infrared1)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 infrared1)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 Star0)
	(supports instrument10 spectrograph0)
	(supports instrument10 infrared1)
	(calibration_target instrument10 GroundStation1)
	(calibration_target instrument10 GroundStation5)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star4)
)
(:goal (and
	(pointing satellite1 Star0)
	(pointing satellite2 Star12)
	(pointing satellite4 GroundStation3)
	(have_image Star6 spectrograph0)
	(have_image Star7 spectrograph0)
	(have_image Star8 infrared1)
	(have_image Star9 spectrograph0)
	(have_image Planet10 infrared1)
	(have_image Star11 spectrograph0)
	(have_image Star12 infrared1)
))

)

; plan
1. (turn_to satellite4 groundstation3 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 groundstation3)
   goals met: 1 of 10
2. (turn_to satellite2 star12 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star12)
   goals met: 2 of 10
3. (turn_to satellite1 star0 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star0)
   goals met: 3 of 10
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 10
5. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 3 of 10
6. (turn_to satellite0 star12 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star12)
   goals met: 3 of 10
7. (take_image satellite0 star12 instrument0 infrared1)
   added: (have_image star12 infrared1)
   goals met: 4 of 10
8. (turn_to satellite0 star11 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star11)
   goals met: 4 of 10
9. (take_image satellite0 star11 instrument0 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 5 of 10
10. (turn_to satellite0 planet10 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet10)
   goals met: 5 of 10
11. (take_image satellite0 planet10 instrument0 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 6 of 10
12. (turn_to satellite0 star6 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star6)
   goals met: 6 of 10
13. (take_image satellite0 star6 instrument0 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 7 of 10
14. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 7 of 10
15. (take_image satellite0 star7 instrument0 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 8 of 10
16. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 8 of 10
17. (take_image satellite0 star8 instrument0 infrared1)
   added: (have_image star8 infrared1)
   goals met: 9 of 10
18. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 9 of 10
19. (take_image satellite0 star9 instrument0 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 10 of 10
